# -*- mode: org; coding: utf-8; -*-
# Source:     https://github.com/novoid/dot-emacs
# License:    This file is licensed under the GPL v3.
#+TODO: ACTIVE | DISABLED
#+STARTUP: indentn

This is the GNU/Emacs config file of

This file is named =config.org=. My =init.el= got some nifty Elisp code
that converts/tangles (only) the Elisp blocks into the =config.el=.
This generated file is interpreted by my GNU/Emacs on startup.

Note that all Elisp blocks part of a =DISABLED= heading or which are
marked with =:tangle no= won't be tangled to the =config.el= file.
Unfortunately, within the Org-mode rendering of GitHub, you won't see
the =DISABLED= keyword nor the =:tangle no= parameter of the babel
blocks. Please get the Org-mode file and open it in your Emacs directly.

Originally, I found this process on
http://www.holgerschurig.de/en/emacs-init-tangle/ However, I adapted
its code and write additional features.


Links that start with =id:= won't work for you because they link to my
personal Org-mode files.

-----------------------

Some minor tasks I plan to do with my =config.org=:

- flyspell bindkeys:
  - [ ] create a hydra some day

- [ ] FIXXME: check why Python "auto-complete mode" is disabled in my config
- [ ] FIXXME: check why Python > Ropemacs (for refactoring) is disabled in my config


*** jsdoc
:PROPERTIES:
:CREATED:  [2018-03-26 Mon 19:44]
:END:
#+begin_src emacs-lisp :tangle yes
(add-to-list 'load-path "~/.emacs.d/contrib/")
(require 'js-doc)

; (setq js-doc-mail-address "your email address"
;        js-doc-author (format "your name <%s>" js-doc-mail-address)
;        js-doc-url "url of your website"
;       js-doc-license "license name")

(add-hook 'js2-mode-hook
#'(lambda ()
(define-key js2-mode-map "\C-ci" 'js-doc-insert-function-doc)
(define-key js2-mode-map "@" 'js-doc-insert-tag)))
#+end_src

#+RESULTS:
| lambda | nil | (define-key js2-mode-map i (quote js-doc-insert-function-doc)) | (define-key js2-mode-map @ (quote js-doc-insert-tag))        |                                                    |                                                             |                                                         |
| lambda | nil | (local-set-key (kbd C-x C-e) (quote js-send-last-sexp))          | (local-set-key (kbd C-M-x) (quote js-send-last-sexp-and-go)) | (local-set-key (kbd C-c b) (quote js-send-buffer)) | (local-set-key (kbd C-c C-b) (quote js-send-buffer-and-go)) | (local-set-key (kbd C-c l) (quote js-load-file-and-go)) |

